[
  {
    "name": "Green salad with strawberry-mustard dressing",
    "description": [
      "Preheat the oven to 160°C/320°F and roast the pistachios for 5 – 8 min.",
      "Wash mini cucumbers and strawberries. Cut both into thin slices. Chop pistachios.",
      "For the dressing, zest and juice the lemon. Using an immersion blender, blend the remaining strawberries with mustard, lemon zest and juice, olive oil, honey, salt, and pepper. Add poppy seeds and mix well with a spoon.",
      "Add baby spinach, arugula, pistachios, cucumbers, and strawberries to a bowl. Mix well, top with the dressing, and garnish with fresh mint. Enjoy!"
    ],
    "ingredients": [
      {
        "name": "baby spinach",
        "amount": 100,
        "measure": "g"
      },
      {
        "name": "arugula",
        "amount": 50,
        "measure": "g"
      },
      {
        "name": "strawberries",
        "amount": 200,
        "measure": "g"
      },
      {
        "name": "mustard",
        "amount": 0.5,
        "measure": "tsp"
      },
      {
        "name": "pistachios",
        "amount": 30,
        "measure": "g"
      },
      {
        "name": "mini cucumbers",
        "amount": 4
      },
      {
        "name": "lemon",
        "amount": 0.5
      },
      {
        "name": "olive oil",
        "amount": 50,
        "measure": "ml"
      },
      {
        "name": "honey",
        "amount": 2,
        "measure": "tsp"
      },
      {
        "name": "poppy seed",
        "amount": 1,
        "measure": "tbsp"
      },
      {
        "name": "mint (for garnish)",
        "amount": 4,
        "measure": "springs"
      },
      {
        "name": "salt"
      },
      {
        "name": "pepper"
      }
    ],
    "category": {
      "mealType": "Salad",
      "meal": "Salad",
      "region": "European",
      "nutrition": "Vegan, Vegetarian"
    },
    "image": "/imgs/recept/R1621-photo-final-1.webp",

    "preparationTime": 25,

    "portion": 2,

    "comments": [],

    "recipeRanking": []
  },
  {
    "name": "Cheese Burger",
    "description": [
      "Preheat the grill. Slice onion into thin rings. Gently sauté half of the onions in some olive oil. Season with salt and pepper.",
      "Season ground beef with some pepper to taste and form into burger patties with damp hands. Create a small well in the middle to prevent the burger from puffing up during cooking.",
      "Place patties on the hot grill and cook for approx. 4 – 5 min. per side, depending on the thickness. Place a slice of cheddar cheese on each patty and let it melt for a minute.",
      "Cut tomato and cucumber into slices. Cut the burger buns lengthwise and butter if desired.",
      "Assemble burger with grilled patties, tomato and cucumber slices, raw onion slices, sautéed onions, iceberg lettuce, ketchup, and mayonnaise. Enjoy!"
    ],
    "ingredients": [
      {
        "name": "burger buns",
        "amount": 4
      },
      {
        "name": "ground beef",
        "amount": 800,
        "measure": "g"
      },
      {
        "name": "tomato",
        "amount": 1
      },
      {
        "name": "cucumber",
        "amount": 0.5
      },
      {
        "name": "onions (red)",
        "amount": 2
      },
      {
        "name": "cheddar cheese",
        "amount": 4,
        "measure": "slices"
      },
      {
        "name": "mayonnaise",
        "amount": 4,
        "measure": "tsp"
      },
      {
        "name": "ketchup",
        "amount": 4,
        "measure": "tsp"
      },
      {
        "name": "iceberg lettuce",
        "amount": 4,
        "measure": "leaves"
      },
      {
        "name": "salt"
      },
      {
        "name": "pepper"
      },
      {
        "name": "olive oil for frying"
      },
      {
        "name": "butter for serving"
      }
    ],
    "category": {
      "mealType": "Main Course",
      "meal": "Meat Dishes",
      "region": "American"
    },
    "image": "/imgs/recept/TheBurger_Final.webp",

    "preparationTime": 30,

    "portion": 4,

    "comments": [],

    "recipeRanking": [],

    "explanation": "These juicy homemade cheeseburgers are worth staying home for! A perfectly seasoned beef patty, covered with melted cheese and topped with pickles, onion, ketchup and mustard- all encased in a soft brioche bun. Who wants a cheeseburger that tastes better than your favourite takeaway version?! Perfect for family burger night- or any time."
  },
  {
    "name": "Baba Ganoush",
    "description": [
      "Preheat the oven to 200 degrees top/bottom heat (180 degrees fan oven).",
      "Wash the aubergines, cut off the ends and cut in half. Score the flesh lightly with the tip of a knife. Place the aubergines cut-side up on a baking sheet lined with parchment paper and roast on the middle rack for 50-60 minutes. The aubergine halves should have collapsed by the end of the cooking time. Take out and let cool.",
      "Meanwhile, peel the garlic clove(s) and press through a garlic press. Wash the coriander, shake dry and chop finely. Halve the lemon and squeeze out about 2 tablespoons of juice.",
      "Scoop out the flesh of the aubergines with a spoon and place in a tall mixing bowl. Add the garlic, lemon juice and tahini. Finely puree using a hand blender. Season to taste with salt, pepper and cumin.",
      "Pour the baba ganoush into a bowl, pour olive oil in the middle and serve garnished with chopped coriander and sesame seeds. Enjoy with flatbread if you like."
    ],
    "ingredients": [
      {
        "name": "globe eggplants",
        "amount": 4
      },
      {
        "name": "tahini",
        "amount": 120,
        "measure": "g"
      },
      {
        "name": "clove(s) garlic",
        "amount": 4
      },
      {
        "name": "pomegranate molasses",
        "amount": 25,
        "measure": "ml"
      },
      {
        "name": "olive oil",
        "amount": 25,
        "measure": "ml"
      },
      {
        "name": "parsley",
        "amount": 12,
        "measure": "g"
      },
      {
        "name": "salt",
        "amount": 10,
        "measure": "g"
      },
      {
        "name": "ground pepper",
        "amount": 1,
        "measure": "g"
      },
      {
        "name": "pomegranate seeds",
        "amount": 40,
        "measure": "g"
      }
    ],
    "category": {
      "mealType": "Appetizer",
      "meal": "Sides",
      "region": "Oriental",
      "nutrition": "Vegan, Gluten Free"
    },
    "image": "/imgs/recept/pexels-shameel-mukkath-14774982.jpg",

    "preparationTime": 75,

    "portion": 4,

    "comments": [],

    "recipeRanking": [],

    "explanation": "The traditional preparation method of Baba Ganoush is for the eggplant to be roasted or broiled over an open flame before peeling, so that the pulp is soft and has a smoky taste. It is a typical meze of Lebanese cuisine, often eaten as a dip and is sometimes added to other dishes."
  },
  {
    "name": "Turkish Baklava",
    "description": [
      "First, preheat the oven to 150 degrees (top and bottom heat).",
      "Put the pistachios in a bowl with the walnuts, cinnamon, breadcrumbs, sugar and clove(s) and mix well.",
      "Melt the clarified butter in a small saucepan over low heat and brush a baking tray with some clarified butter.",
      "Now place a thin layer of puff pastry on top, brush with clarified butter, place another layer of puff pastry on top and brush with clarified butter again.",
      "Halfway through the prepared puff pastry, spread the pistachio mixture over the pastry. Then finish layering with the remaining puff pastry, brushing each layer with clarified butter.",
      "Now cut the baklava on the baking tray into the typical small pieces and bake in the preheated oven for 35 to 40 minutes until golden brown.",
      "In the meantime, for the sugar syrup, mix the water with the sugar and heat in a saucepan over a low heat. Stir the syrup until the sugar has completely dissolved.",
      "Then add a pinch of salt and let the syrup simmer for another 20 minutes.",
      "Finally stir in the lemon juice, simmer for another 5 minutes and then allow the syrup to cool at room temperature.",
      "Once the baklava is golden brown, remove from the oven and allow to cool at room temperature.",
      "Then spread the sugar syrup evenly over the baklava and leave to stand for 3 hours."
    ],
    "ingredients": [
      {
        "name": "Puff pastry, for baklava",
        "amount": 500,
        "measure": "g"
      },
      {
        "name": "clarified butter",
        "amount": 375,
        "measure": "g"
      },
      {
        "name": "Pistachios, chopped",
        "amount": 200,
        "measure": "g"
      },
      {
        "name": "walnuts, ground",
        "amount": 200,
        "measure": "g"
      },
      {
        "name": "Ground cinnamon",
        "amount": 0.5,
        "measure": "tsp"
      },
      {
        "name": "breadcrumbs",
        "amount": 2,
        "measure": "tbsp"
      },
      {
        "name": "Sugar",
        "amount": 2,
        "measure": "tbsp"
      },
      {
        "name": "clove powder",
        "amount": 1,
        "measure": "tsp"
      },
      {
        "name": "water",
        "amount": 600,
        "measure": "ml"
      },
      {
        "name": "Sugar",
        "amount": 400,
        "measure": "g"
      },
      {
        "name": "lemon juice",
        "amount": 1,
        "measure": "tbsp"
      },
      {
        "name": "salt",
        "amount": 1,
        "measure": "prize"
      }
    ],
    "category": {
      "mealType": "Dessert",
      "meal": "Dessert",
      "region": "Turkish"
    },
    "image": "/imgs/recept/pexels-rukiye-demir-12014350.jpg",

    "preparationTime": 265,

    "portion": 8,

    "comments": [],

    "recipeRanking": [],

    "explanation": "My recipe for baklava is inspired by my years in Istanbul, Turkey where we used to get cevizli baklava (walnut baklava) or fıstıklı baklava (pistachio baklava) regularly from a shop right by the Bosporus called Faruk Güllüoğlu."
  },
  {
    "name": "Simple marinated chicken wings",
    "description": [
      "For the marinade, juice the lime. Finely mince the garlic. Add both into a large bowl or a zipper bag with the soy sauce, honey, and vegetable oil. Mix until combined. Set aside 4 tbsp. of the marinade for basting later.",
      "Add the chicken wings to the marinade. Let marinate for at least 30 min. or up to 6 hrs. in the fridge. When ready for the next step, set the oven to 220°C/430°F. Line a baking sheet with baking paper.",
      "Roast wings in the oven for 20–25 min., flipping once halfway through. Once the wings have a dark golden brown color, and the juice runs clear when poked with a knife, they are ready. If you want more color, turn on the grilling function for a few minutes, but watch closely so they don’t burn. In the meantime, toast some sesame seeds for serving.",
      "Place the wings on a serving plate and brush with some more leftover marinade. Top with toasted sesame seeds and serve with lime wedges."
    ],
    "ingredients": [
      {
        "name": "Chicken Wings",
        "amount": 1500,
        "measure": "g"
      },
      {
        "name": "light soy sauce",
        "amount": 80,
        "measure": "ml"
      },
      {
        "name": "honey",
        "amount": 1,
        "measure": "tbsp"
      },
      {
        "name": "limes",
        "amount": 2
      },
      {
        "name": "garlic",
        "amount": 2,
        "measure": "clove(s)"
      },
      {
        "name": "vegetable oil",
        "amount": 4,
        "measure": "tbsp"
      },
      {
        "name": "sesame seed (toasted, for serving)",
        "amount": 1,
        "measure": "tbsp"
      }
    ],
    "category": {
      "mealType": "Main Course",
      "meal": "Meat Dishes",
      "region": "French"
    },
    "image": "/imgs/recept/chicken-wings.webp",

    "preparationTime": 80,

    "portion": 6,

    "comments": [],

    "recipeRanking": [],

    "explanation": "Chicken wings are perfect when you want to grill (on an actual BBQ or in the oven) something simple and delicious for a crowd. They are forgiving in that they are hard to overcook. In this recipe, we made a quick marinade to ensure they’re seasoned inside and out. The soy sauce adds both a nice golden brown color and an umami touch, balanced with honey and lime. Remember to put aside some of the marinade for brushing on right before serving."
  },
  {
    "name": "Imam Bayildi",
    "description": [
      "Prepare the eggplants. Preheat your oven and line a baking pan with non-stick baking paper. Peel the eggplants in zebra stripes without removing the stem. You can use a vegetable peeler or sharp knife for this. Allow them to soak in salted water for 15 minutes and then gently squeeze out excess water and pat them dry with a paper towel. Prick some holes on the eggplants using a fork.",
      "Brush each eggplant with some olive oil, and bake them in the oven for roughly 30 minutes or until they are tender.",
      "Prepare the filling. Heat the olive oil and sauté the onions until they are translucent. Add the chopped green peppers and cook them for about 2-3 minutes. Then, add in your tomatoes, garlic, sugar, salt, and black pepper.",
      "Cook these ingredients together for roughly 5 minutes. Remove the filling from the heat and add your freshly chopped mint and parsley.",
      "stuff the eggplants. Cut lengthwise slits on the roasted eggplants without slicing all the way through. Using a teaspoon, gently push the edges in the deep slits to make a boat shape for the filling to lay in. Divide the filling between all of the eggplants. Place them in a baking dish, in a single layer.",
      "Make the sauce. In a small bowl, whisk together the water and tomato paste and pour the sauce over the eggplants. Place them in the oven again and continue baking them for 30-40 minutes.",
      "Remove from the oven and serve at room temperature or chilled."
    ],
    "ingredients": [
      {
        "name": "eggplants",
        "amount": 4
      },
      {
        "name": "salt"
      },
      {
        "name": "pepper"
      },
      {
        "name": "olive oil",
        "amount": 125,
        "measure": "ml"
      },
      {
        "name": "onion",
        "amount": 2
      },
      {
        "name": "tomato",
        "amount": 500,
        "measure": "g"
      },
      {
        "name": "garlic",
        "amount": 2,
        "measure": "toes"
      },
      {
        "name": "parsley, chopped",
        "amount": 50,
        "measure": "g"
      },
      {
        "name": "sugar",
        "amount": 1,
        "measure": "pinch"
      }
    ],
    "category": {
      "mealType": "Main Course",
      "region": "Turkish",
      "nutrition": "Vegan, Vegetarian"
    },
    "image": "/imgs/recept/imam-bayildi.jpg",

    "preparationTime": 85,

    "portion": 4,

    "comments": [],

    "recipeRanking": [],

    "explanation": "Turkish stuffed aubergines so delicious the imam who first ate them, fainted out of pure delight. Or was it in shock? Nevermind, the only thing that matters is this: Imam bayildi is perhaps the most delicious thing you can make with the mighty aubergine."
  },
  {
    "name": "Tofu stir-fry with rice",
    "description": [
      "Add rice to saucepan. Cover with 1.5 parts of water, add salt and bring to a simmer. Reduce to low heat, cover and allow to cook for approx. 10 – 15 min. until fluffy and cooked through. Remove from heat and set aside.",
      "Halve sugar snap peas with a diagonal cut, thinly slice bell pepper, and cut tofu lengthwise into even pieces.",
      "Heat some vegetable oil in a frying pan over medium heat. Fry tofu slices on each side for approx. 3 – 5 min. until lightly roasted and crisp.",
      "Add tofu, soy sauce, and sweet chili sauce to a bowl. Stir well to evenly coat tofu slices with marinade. Set aside.",
      "Add nuts to pan and roast over medium-low heat until golden brown and fragrant. Set aside.",
      "Heat some more vegetable oil in frying pan and sauté sugar snap peas and peppers in a pan over medium heat for approx. 5 – 7 min. until lightly roasted. Season with salt and pepper.",
      "Add vegetables to tofu and gently stir to combine. Serve with rice. Sprinkle with toasted nuts and, if desired, with fresh cilantro leaves."
    ],
    "ingredients": [
      {
        "name": "rice",
        "amount": 200,
        "measure": "g"
      },
      {
        "name": "water",
        "amount": 300,
        "measure": "ml"
      },
      {
        "name": "snap peas",
        "amount": 80,
        "measure": "g"
      },
      {
        "name": "red bell peppers",
        "amount": 80,
        "measure": "g"
      },
      {
        "name": "smoked tofu",
        "amount": 200,
        "measure": "g"
      },
      {
        "name": "soy sauce",
        "amount": 1,
        "measure": "tbsp"
      },
      {
        "name": "sweet chili sauce",
        "amount": 1,
        "measure": "tbsp"
      },
      {
        "name": "peanuts",
        "amount": 40,
        "measure": "g"
      },
      {
        "name": "salt"
      },
      {
        "name": "pepper"
      },
      {
        "name": "vegetable oil (for frying)"
      },
      {
        "name": "cilantro (for serving)"
      }
    ],
    "category": {
      "mealType": "Main Course",
      "region": "Asian"
    },
    "image": "/imgs/recept/tofu.webp",

    "preparationTime": 30,

    "portion": 2,

    "comments": [],

    "recipeRanking": []
  },
  {
    "name": "Basic potato gratin",
    "description": [
      "Preheat oven to 170°C/340°F. Peel and cut the clove of garlic in half. Rub baking dish first with cut side of the garlic and then grease with butter.",
      "Peel potatoes if desired and cut into thin slices. Arrange the slices in overlapping layers in the baking dish.",
      "Generously season heavy cream with nutmeg, salt and pepper and pour over potatoes. Bake in preheated oven at 170°C/340°F on the bottom rack for approx. 40 – 45 min. until golden. Allow to cool for 5 min. before serving."
    ],
    "ingredients": [
      {
        "name": "potatoes",
        "amount": 700,
        "measure": "g"
      },
      {
        "name": "whipping cream",
        "amount": 500,
        "measure": "ml"
      },
      {
        "name": "garlic",
        "amount": 1,
        "measure": "clove(s)"
      },
      {
        "name": "nutmeg (ground)",
        "amount": 0.25,
        "measure": "tsp"
      },
      {
        "name": "butter for greasing"
      },
      {
        "name": "salt"
      },
      {
        "name": "pepper"
      }
    ],
    "category": {
      "meal": "Sides",
      "region": "German"
    },
    "image": "/imgs/recept/BasicPotatoGratin_Final.webp",

    "preparationTime": 60,

    "portion": 6,

    "comments": [],

    "recipeRanking": []
  },
  {
    "name": "Sriracha lime-glazed salmon",
    "description": [
      "Peel and finely chop garlic. Whisk together lime zest, lime juice, honey, Sriracha, and garlic in small bowl. Reserve half of the mixture.",
      "Season salmon with salt and pepper. Brush with some of the sriracha mixture.",
      "Preheat oven to 220°C/425°F. Heat oil in large ovenproof frying pan over medium-high heat. Once oil starts to shimmer, add salmon, flesh side-down. Fry for approx. 1 min. or until golden. Flip over. Brush with more of the Sriracha mixture.",
      "Transfer to oven in frying pan and bake at 220°C/425°F for approx. 10 min., brushing with Sriracha mixture halfway through. The salmon is done when it flakes easily when tested with a fork.",
      "Drizzle with reserved Sriracha mixture. Sprinkle with sesame seeds and green onions. If desired, serve with a side of steamed bok choy. Enjoy!"
    ],
    "ingredients": [
      {
        "name": "salmon fillets (wild)",
        "amount": 4
      },
      {
        "name": "Sriracha",
        "amount": 2,
        "measure": "tbsp"
      },
      {
        "name": "garlic",
        "amount": 2,
        "measure": "clove(s)"
      },
      {
        "name": "limes (zest)",
        "amount": 2
      },
      {
        "name": "lime (juice)",
        "amount": 1
      },
      {
        "name": "honey",
        "amount": 90,
        "measure": "g"
      },
      {
        "name": "sesame oil",
        "amount": 2,
        "measure": "tsp"
      },
      {
        "name": "salt"
      },
      {
        "name": "pepper"
      },
      {
        "name": "sesame seeds for serving"
      },
      {
        "name": "sliced green onions for serving"
      },
      {
        "name": "steamed bok choy for serving"
      }
    ],
    "category": {
      "mealType": "Main Course",
      "meal": "Fish Dishes",
      "region": "Asian"
    },
    "image": "/imgs/recept/R669-photo-final-4x3.webp",

    "preparationTime": 30,

    "portion": 4,

    "comments": [],

    "recipeRanking": [],

    "explanation": "A simple soy sauce and brown sugar marinade, with hints of lemon and garlic, are the perfect salty-sweet complement to rich salmon fillets. Even my 9 year old loves this recipe!"
  },
  {
    "name": "Neapolitan-style pizza",
    "description": [
      "Add 00 flour, whole wheat flour, and dry yeast to a large bowl. Mix with a whisk until combined. Add the lukewarm water. Mix with a rubber spatula until no dry flour is visible. The dough will be relatively moist at this point. Drizzle the surface with a little olive oil, then cover with a kitchen towel or dough cover and leave to rise in a warm place. After approx. 1.5 – 2 hrs, the volume should have doubled and you can continue with step 2. Alternatively, you can leave the dough in the fridge to slowly rise overnight to further develop flavor and get an even puffier result.",
      "Dust a work surface with flour. Tip the dough out of the bowl, fold each side into the centre to trap in some air and turn it over. Use flour as needed to help handle the dough (this will depend on how wet your dough is), but use sparingly. Divide the dough into four equal parts using a dough cutter. Fold each of these pieces using the same method as above. Place each dough ball seam-side down and shape into a firm ball using the edges of your hands and moving in a circular motion. Now either store, individually wrapped, in the fridge for up to 3 days (take out 1 hr. before baking), store in the freezer for up to 3 months (take out at least 8 hrs. before baking) or leave to rest on the work surface for approx. 1 hr. (if you’re in an absolute hurry, you could reduce this resting time) and use immediately.",
      "In the meantime, preheat the oven to the highest setting on the top/bottom heat function and place an inverted baking sheet on the lowest shelf. Once the oven is preheated and the rising time is over, shape each dough ball into a pizza: Flour the work surface and use your fingertips to flatten the ball from the inside out, leaving a thick edge. Use flour as needed. Once your palm can fit in the centre, lift the dough up and use gravity, stretching gently. to help you form a larger pizza. Place on a sheet of parchment paper, which, if you have one, you can place on top of a pizza paddle.",
      "Top your pizza with whatever you like best. I like to use canned tomatoes mixed with fresh garlic, salt and a little olive oil as a base and then add buffalo mozzarella and basil after baking. It’s best not to use too much sauce, 1.5 – 2 tablespoons are usually enough, and be sure to transfer your pizza in the oven with the baking paper immediately after topping so that the raw dough doesn't draw in too much liquid. As soon as the pizza has baked through, after approx. 3 – 4 min., carefully remove the parchment paper from underneath and finish baking the pizza. Keep baking for approx. 8 – 12 min. (the timing will depend on your oven) until your crust is browned. Repeat the process with the remaining dough. If you like, finish with some lemon zest and freshly grated Parmesan.",
      "Happy pizza making—enjoy!"
    ],
    "ingredients": [
      {
        "name": "Italian 00 flour",
        "amount": 400,
        "measure": "g"
      },
      {
        "name": "whole-wheat flour",
        "amount": 100,
        "measure": "g"
      },
      {
        "name": "active dry yeast",
        "amount": 1,
        "measure": "tsp"
      },
      {
        "name": "salt",
        "amount": 2.5,
        "measure": "tsp"
      },
      {
        "name": "water (lukewarm)",
        "amount": 500,
        "measure": "ml"
      },
      {
        "name": "canned crushed tomatoes",
        "amount": 400,
        "measure": "g"
      },
      {
        "name": "garlic",
        "amount": 1,
        "measure": "clove(s)"
      },
      {
        "name": "olive oil",
        "amount": 1,
        "measure": "tbsp"
      },
      {
        "name": "buffalo mozzarella cheese",
        "amount": 200,
        "measure": "g"
      },
      {
        "name": "basil (for serving)",
        "amount": 1,
        "measure": "stalk"
      },
      {
        "name": "lemon (for serving)",
        "amount": 1
      },
      {
        "name": "flour (for dusting)"
      },
      {
        "name": "olive oil (for greasing)"
      },
      {
        "name": "Parmesan cheese (grated, for serving)"
      }
    ],
    "category": {
      "mealType": "Main Course",
      "meal": "Pizza & Pasta",
      "region": "Italian"
    },
    "image": "/imgs/recept/neapolitan-pizza.webp",

    "preparationTime": 30,

    "portion": 4,

    "comments": [],

    "recipeRanking": [],

    "explanation": "If you want to make pizza night a regular thing at home you need a recipe that suits your schedule—and gives you foolproof pizza. This recipe is my go-to, no matter whether I want to eat pizza pronto, the next day or even the day after—and you don’t need any fancy equipment like a pizza stone for a great result."
  },
  {
    "name": "Classic tiramisu",
    "description": [
      "Separate eggs. Beat egg yolks with some confectioner’s sugar until pale and fluffy. Add Amaretto and mascarpone. Beat until smooth.",
      "Beat egg whites with a pinch of salt until stiff peaks form. Slowly whisk in the remaining confectioner’s sugar. Carefully fold beaten egg whites into mascarpone cream.",
      "Beat egg whites with a pinch of salt until stiff peaks form. Slowly whisk in the remaining confectioner’s sugar. Carefully fold beaten egg whites into mascarpone cream.",
      "Repeat layering process until all ingredients are used up. Finish up with a layer of mascarpone cream, finely grated chocolate, and a dusting of unsweetened cocoa powder. Refrigerate for approx. at least 3 hrs. before serving. Enjoy!"
    ],
    "ingredients": [
      {
        "name": "mascarpone cheese",
        "amount": 250,
        "measure": "g"
      },
      {
        "name": "ladyfingers",
        "amount": 250,
        "measure": "g"
      },
      {
        "name": "eggs",
        "amount": 2
      },
      {
        "name": "confectioner’s sugar",
        "amount": 60,
        "measure": "g"
      },
      {
        "name": "espresso",
        "amount": 100,
        "measure": "ml"
      },
      {
        "name": "amaretto",
        "amount": 3,
        "measure": "tbsp"
      },
      {
        "name": "bittersweet chocolate",
        "amount": 1,
        "measure": "tbsp"
      },
      {
        "name": "unsweetened cocoa powder",
        "amount": 1,
        "measure": "tbsp"
      },
      {
        "name": "salt"
      }
    ],
    "category": {
      "mealType": "Dessert",
      "meal": "Dessert",
      "region": "Italian",
      "nutrition": "Vegetarian"
    },
    "image": "/imgs/recept/tiramisu.webp",

    "preparationTime": 30,

    "portion": 6,

    "comments": [],

    "recipeRanking": [],

    "explanation": "For this tiramisu recipe I used strong and freshly brewed espresso, not the instant powder. It makes a difference, trust me. Make sure the coffee has cooled slightly and that you don't soak the ladyfingers, but just quickly dunk them in the Amaretto-espresso mixture. "
  },
  {
    "name": "One-pot creamy Cajun chicken pasta",
    "description": [
      "Cut the chicken into equal bite-sized cubes. Deseed the peppers and cut them into squares. Finely dice the onion and garlic.",
      "Toss the diced chicken with the Cajun seasoning and season with salt. Heat the oil and butter in a large pot. Add the chicken and sear for approx. 4—5 min, tossing regularly. The chicken does not need to be cooked through, as it will continue cooking later on. Remove the chicken from the pan and transfer to a bowl.",
      "Next, add the diced onion and bell pepper to the pot and sauté for approx. 4—5 min. until soft. Then, add the garlic and fry, for another 30 sec. Transfer the chicken back to the pan and add the pasta, diced tomatoes, and chicken stock. Add more stock or water to cover the pasta if needed. Now bring to a boil, then reduce the heat and let simmer for approx. 10 min., until the pasta is al dente and the chicken is cooked through.",
      "Stir in the cream cheese until it is melted and incorporated into the sauce. Season to taste with salt and pepper and serve the pasta with freshly chopped parsley. Enjoy!"
    ],
    "ingredients": [
      {
        "name": "chicken breasts",
        "amount": 700,
        "measure": "g"
      },
      {
        "name": "Cajun seasoning",
        "amount": 3,
        "measure": "tbsp"
      },
      {
        "name": "penne",
        "amount": 500,
        "measure": "g"
      },
      {
        "name": "red bell pepper",
        "amount": 1
      },
      {
        "name": "espresso",
        "amount": 100,
        "measure": "ml"
      },
      {
        "name": "amaretto",
        "amount": 3,
        "measure": "tbsp"
      },
      {
        "name": "bittersweet chocolate",
        "amount": 1,
        "measure": "tbsp"
      },
      {
        "name": "unsweetened cocoa powder",
        "amount": 1,
        "measure": "tbsp"
      },
      {
        "name": "salt"
      }
    ],
    "category": {
      "mealType": "Main Course",
      "meal": "Pizza & Pasta",
      "region": "Italian"
    },
    "image": "/imgs/recept/pasta.webp",

    "preparationTime": 30,

    "portion": 4,

    "comments": [],

    "recipeRanking": [],

    "explanation": "This convenient, creamy one-pot pasta is all a weeknight dinner should be, spiced up with delicious Cajun seasoning from Louisiana. If you can't find the spice mix at the supermarket, you can also make it at home. Just mix 2 tsp smoked paprika, 1 tsp oregano, 1 tsp thyme, ½ tsp garlic powder, ½ tsp onion powder, ½ tsp cumin, ¼ tsp cayenne pepper, ¼ tsp black pepper, and ¼ tsp salt together in an airtight glass jar. The spice mix goes really well with fish and chicken."
  },
  {
    "name": "Stuffed Flounder",
    "description": [
      "Preheat the oven to 400°F.",
      "Begin by cutting only one fillet of flounder into smaller pieces to use in the stuffing. Leave the remaining four fillets whole. If you have larger scallops and/or shrimp, cut them into smaller bite size pieces for the stuffing.",
      "Heat up the olive oil in a skillet and add in the garlic. Saute over a medium/high flame for about a minute or until golden and then add in the bay scallops. Saute together for about a minute and then add in the shrimp and continue sauteing for another minute.",
      "Lower the heat to a medium flame and add four tablespoons of butter into the skillet and mix with the fish for about three minutes. Pour in the wine and mix together for about another three minutes.",
      "Add a pinch of salt and black pepper, about half of the parsley, and 1/4 cup of the breadcrumbs and mix together. Cook over a low flame for about five minutes and then remove from the stove.",
      "In a baking dish, lay two flounder fillets side by side. Scoop the stuffing onto both fillets. Sprinkle some breadcrumbs and parsley on top of each fillet stuffing and then place the last two fillets on top of the stuffing. Sprinkle some more breadcrumbs on top of each fillet and then add a few pieces of butter on top. Place in the oven and cook for about thirty minutes.",
      "Remove from the oven and enjoy with a sprinkle of parsley on top. Salute and cin cin!"
    ],
    "ingredients": [
      {
        "name": "flounder (five fillets)",
        "amount": 680,
        "measure": "g"
      },
      {
        "name": "bay scallops (washed)",
        "amount": 454,
        "measure": "g"
      },
      {
        "name": "shrimp (peeled and cleaned)",
        "amount": 454,
        "measure": "g"
      },
      {
        "name": "butter",
        "amount": 113,
        "measure": "g"
      },
      {
        "name": "breadcrumbs",
        "amount": 54,
        "measure": "g"
      },
      {
        "name": "garlic",
        "amount": 5,
        "measure": "clove(s)"
      },
      {
        "name": "parsley (chopped)",
        "amount": 1,
        "measure": "handful"
      },
      {
        "name": "olive oil",
        "amount": 62,
        "measure": "ml"
      },
      {
        "name": "white wine (Pinot Grigio)",
        "amount": 59,
        "measure": "ml"
      },
      {
        "name": "sea salt"
      },
      {
        "name": "black pepper"
      }
    ],
    "category": {
      "mealType": "Fish",
      "meal": "Fish",
      "region": "Italian"
    },
    "image": "/imgs/recept/stuffedFlounder.webp",

    "preparationTime": 15,

    "portion": 5,

    "comments": [],

    "recipeRanking": [],

    "explanation": "Hello Everybody! Today I would like to share with you my Stuffed Flounder recipe I make every year on Christmas Eve! I make a lot of fish recipes for the family on Christmas Eve, like seafood salad, linguine with clams, and oysters, but this stuffed flounder is one of the favorites. Watch the full video to follow along as I cook this recipe step by step or continue scrolling for the written recipe."
  },
  {
    "name": "Garlic Butter Steak",
    "description": [
      "Preheat a grill or grill pan to high heat.",
      "Season the steak with salt and black pepper.",
      "Grill the steak for 4-6 minutes per side, or until cooked to your desired doneness.",
      "Meanwhile, in a small saucepan, melt the butter over medium heat. Add the garlic and cook for 1-2 minutes, or until fragrant.",
      "Remove the steak from the grill and let it rest for 5 minutes.",
      "Slice the steak against the grain and drizzle the garlic butter over the top. Serve immediately."
    ],
    "ingredients": [
      {
        "name": "steak (such as ribeye or sirloin)",
        "amount": 454,
        "measure": "g"
      },
      {
        "name": "butter",
        "amount": 113,
        "measure": "g"
      },
      {
        "name": "garlic",
        "amount": 2,
        "measure": "clove(s)"
      },
      {
        "name": "salt"
      },
      {
        "name": "black pepper"
      }
    ],
    "category": {
      "mealType": "Meat",
      "meal": "Steak",
      "region": "American"
    },
    "image": "/imgs/recept/garlicButterSteak.jpg",

    "preparationTime": 10,

    "portion": 4,

    "comments": [],

    "recipeRanking": [],

    "explanation": "This garlic butter steak recipe is a classic and never fails to impress. It's quick, easy, and packed with flavor. Serve it with a side of roasted vegetables or a simple salad for a complete meal."
},
{
  "name": "Mushroom Risotto",
  "description": [
  "Start by heating the broth in a saucepan and keeping it warm over low heat.",
  "In a separate large saucepan, melt the butter over medium heat. Add the onion and cook until it becomes translucent, stirring occasionally.",
  "Add the mushrooms and cook until they are tender and release their liquid, stirring occasionally.",
  "Add the rice and stir until the grains are coated with the butter and start to turn translucent, about 2-3 minutes.",
  "Pour in the white wine and stir until it evaporates.",
  "Add a ladleful of the warm broth to the rice and stir constantly until the broth is absorbed. Repeat with the remaining broth, one ladleful at a time, until the rice is cooked al dente, about 18-20 minutes.",
  "Stir in the grated Parmesan cheese and chopped parsley, and season with salt and black pepper to taste.",
  "Remove from heat and let the risotto rest for a few minutes before serving.",
  "Garnish with additional Parmesan cheese and parsley, if desired, and enjoy!"
  ],
  "ingredients": [
  {
  "name": "vegetable broth",
  "amount": 960,
  "measure": "ml"
  },
  {
  "name": "butter",
  "amount": 57,
  "measure": "g"
  },
  {
  "name": "onion (finely chopped)",
  "amount": 1,
  "measure": "medium"
  },
  {
  "name": "mushrooms (sliced)",
  "amount": 450,
  "measure": "g"
  },
  {
  "name": "Arborio rice",
  "amount": 360,
  "measure": "g"
  },
  {
  "name": "white wine",
  "amount": 120,
  "measure": "ml"
  },
  {
  "name": "Parmesan cheese (grated)",
  "amount": 113,
  "measure": "g"
  },
  {
  "name": "parsley (chopped)",
  "amount": 1,
  "measure": "handful"
  },
  {
  "name": "salt"
  },
  {
  "name": "black pepper"
  }
  ],
  "category": {
  "mealType": "Main Course",
  "meal": "Risotto",
  "region": "Italian"
  },
  "image": "/imgs/recept/mushroomRisotto.jpg",
  
  "preparationTime": 30,
  
  "portion": 4,
  
  "comments": [],
  
  "recipeRanking": [],
  
  "explanation": "This mushroom risotto recipe is one of my favorite comfort foods. It's warm, creamy, and packed with savory mushroom flavor. The key to making a great risotto is to use Arborio rice, which is a short-grain rice that has a high starch content. This allows the rice to absorb the broth and create a creamy texture. Enjoy this dish as a main course or as a side dish with your favorite protein. Buon appetito!"
  },
  {
    "name": "Vegetable Stir-Fry",
    "description": [
      "Prepare the vegetables by washing and slicing them into bite-sized pieces.",
      "In a small bowl, mix together the soy sauce, honey, and sesame oil.",
      "Heat a wok or large skillet over high heat. Add the vegetable oil and swirl to coat the pan.",
      "Add the garlic and ginger and stir-fry for 30 seconds.",
      "Add the vegetables and stir-fry for 2-3 minutes or until they are just tender but still crisp.",
      "Add the soy sauce mixture and stir-fry for another minute or until the vegetables are coated and the sauce has thickened slightly.",
      "Serve hot over rice or noodles."
    ],
    "ingredients": [
      {
        "name": "broccoli",
        "amount": 1,
        "measure": "head"
      },
      {
        "name": "carrots",
        "amount": 2,
        "measure": "medium"
      },
      {
        "name": "red bell pepper",
        "amount": 1,
        "measure": "large"
      },
      {
        "name": "garlic",
        "amount": 2,
        "measure": "clove(s)"
      },
      {
        "name": "ginger",
        "amount": 1,
        "measure": "tbsp"
      },
      {
        "name": "soy sauce",
        "amount": 3,
        "measure": "tbsp"
      },
      {
        "name": "honey",
        "amount": 2,
        "measure": "tbsp"
      },
      {
        "name": "sesame oil",
        "amount": 1,
        "measure": "tsp"
      },
      {
        "name": "vegetable oil",
        "amount": 2,
        "measure": "tbsp"
      }
    ],
    "category": {
      "mealType": "Vegetarian",
      "meal": "Dinner",
      "region": "Asian"
    },
    "image": "/imgs/recept/vegetableStirFry.jpg",
    "preparationTime": 20,
    "portion": 4,
    "comments": [],
    "recipeRanking": [],
    "explanation": "This vegetable stir-fry is a quick and easy vegetarian meal that's perfect for a busy weeknight. The combination of fresh vegetables and savory sauce makes for a delicious and healthy dinner. Serve it over rice or noodles for a complete meal that's sure to satisfy!" 
  },
  {
    "name": "Creamy Garlic Mushroom Chicken",
    "description": [
      "Season the chicken breasts with salt, black pepper, and garlic powder.",
      "Heat a skillet over medium-high heat and add 2 tablespoons of olive oil. Once hot, add the chicken breasts and cook for 6-7 minutes on each side until golden brown and cooked through. Remove from the skillet and set aside.",
      "Add another tablespoon of olive oil to the skillet and add 1 tablespoon of butter. Once melted, add 8 oz of sliced mushrooms and cook until browned, stirring occasionally. Add 4 minced garlic cloves and cook for 1-2 minutes more.",
      "Pour in 1 cup of chicken broth and bring to a simmer. Add 1 cup of heavy cream and stir to combine. Add 1/2 teaspoon of dried thyme and 1/2 teaspoon of dried oregano. Season with salt and black pepper to taste.",
      "Return the chicken breasts to the skillet and spoon the mushroom cream sauce over them. Simmer for 5-10 minutes until the sauce thickens and the chicken is heated through.",
      "Garnish with chopped fresh parsley and serve hot over pasta, rice, or with a side of vegetables."
    ],
    "ingredients": [
      {
        "name": "chicken breasts",
        "amount": 4,
        "measure": "pieces"
      },
      {
        "name": "salt"
      },
      {
        "name": "black pepper"
      },
      {
        "name": "garlic powder"
      },
      {
        "name": "olive oil",
        "amount": 3,
        "measure": "tbsp"
      },
      {
        "name": "butter",
        "amount": 1,
        "measure": "tbsp"
      },
      {
        "name": "mushrooms (sliced)",
        "amount": 227,
        "measure": "g"
      },
      {
        "name": "garlic (minced)",
        "amount": 4,
        "measure": "clove(s)"
      },
      {
        "name": "chicken broth",
        "amount": 240,
        "measure": "ml"
      },
      {
        "name": "heavy cream",
        "amount": 240,
        "measure": "ml"
      },
      {
        "name": "dried thyme",
        "amount": 0.5,
        "measure": "tsp"
      },
      {
        "name": "dried oregano",
        "amount": 0.5,
        "measure": "tsp"
      },
      {
        "name": "fresh parsley (chopped)"
      }
    ],
    "category": {
      "mealType": "Chicken",
      "meal": "Main Dish",
      "region": "American"
    },
    "image": "/imgs/recept/creamyGarlicMushroomChicken.jpg",

    "preparationTime": 20,

    "portion": 4,

    "comments": [],

    "recipeRanking": [],

    "explanation": "This creamy garlic mushroom chicken recipe is a restaurant-quality meal that you can easily make at home. It's perfect for a weeknight dinner or a special occasion. The chicken is cooked to perfection and then smothered in a rich and creamy mushroom sauce that's flavored with garlic and herbs. Serve it over pasta, rice, or with a side of vegetables for a complete meal. Enjoy!" 
},
{
  "name": "Chiles Rellenos",
  "description": [
    "Preheat oven to 375°F (190°C).",
    "Roast the poblano peppers on a gas burner or under the broiler until charred all over. Place the peppers in a bowl, cover with plastic wrap, and let sit for 15 minutes. Remove the charred skin from the peppers and discard the seeds.",
    "In a skillet, cook the ground beef over medium heat until browned. Add the onion, garlic, cumin, and oregano and cook until the onion is translucent. Add the tomatoes and cook until the mixture has thickened.",
    "Stuff the poblano peppers with the ground beef mixture and place them in a baking dish. Top with grated cheese and bake in the oven until the cheese is melted and bubbly, about 15 minutes.",
    "Serve with rice and beans."
  ],
  "ingredients": [
    {
      "name": "poblano peppers",
      "amount": 6
    },
    {
      "name": "ground beef",
      "amount": 454,
      "measure": "g"
    },
    {
      "name": "onion",
      "amount": 1,
      "measure": "large"
    },
    {
      "name": "garlic",
      "amount": 2,
      "measure": "clove(s)"
    },
    {
      "name": "cumin",
      "amount": 1,
      "measure": "tsp"
    },
    {
      "name": "dried oregano",
      "amount": 1,
      "measure": "tsp"
    },
    {
      "name": "tomatoes",
      "amount": 414,
      "measure": "ml",
      "note": "diced"
    },
    {
      "name": "cheddar cheese",
      "amount": 1,
      "measure": "cup",
      "note": "grated"
    }
  ],
  "category": {
    "mealType": "Main",
    "meal": "Dinner",
    "region": "Mexican"
  },
  "image": "/imgs/recept/chilesRellenos.webp",

  "preparationTime": 45,

  "portion": 6,

  "comments": [],

  "recipeRanking": [],

  "explanation": "Chiles Rellenos, or stuffed peppers, are a classic Mexican dish that are perfect for a hearty and satisfying dinner. This recipe uses poblano peppers stuffed with a savory ground beef mixture and topped with melted cheese. Serve with rice and beans for a complete meal. Enjoy!"
},
{
  "name": "Jollof Rice",
  "description": [
  "Begin by washing the rice in cold water until the water runs clear. Drain and set aside.",
  "Heat up the oil in a large pot over medium heat. Add in the chopped onions and sauté until translucent. Add in the garlic and ginger and cook for another minute.",
  "Add the tomato paste and cook for a minute or two, stirring constantly to prevent burning. Then add in the chopped tomatoes and cook for about 5 minutes, stirring occasionally.",
  "Add in the chicken broth, bay leaves, and thyme. Bring to a boil and then reduce heat to low. Simmer for 10-15 minutes until the sauce thickens and the flavors meld together.",
  "Add in the rice and stir well to combine with the sauce. Cover the pot and simmer on low heat for 20-25 minutes, or until the rice is cooked and tender. Do not stir the rice during cooking.",
  "Once the rice is done, remove from heat and let it sit for 5-10 minutes to steam. Fluff the rice with a fork and serve hot with your choice of protein or vegetables. Enjoy!"
  ],
  "ingredients": [
  {
  "name": "long-grain rice",
  "amount": 2,
  "measure": "cups"
  },
  {
  "name": "vegetable oil",
  "amount": 1,
  "measure": "cup"
  },
  {
  "name": "onions (chopped)",
  "amount": 2,
  "measure": "medium"
  },
  {
  "name": "garlic (minced)",
  "amount": 2,
  "measure": "cloves"
  },
  {
  "name": "ginger (minced)",
  "amount": 1,
  "measure": "tbsp"
  },
  {
  "name": "tomato paste",
  "amount": 178,
  "measure": "ml"
  },
  {
  "name": "tomatoes (chopped)",
  "amount": 3,
  "measure": "medium"
  },
  {
  "name": "chicken broth",
  "amount": 4,
  "measure": "cups"
  },
  {
  "name": "bay leaves",
  "amount": 2
  },
  {
  "name": "dried thyme",
  "amount": 1,
  "measure": "tsp"
  },
  {
  "name": "salt",
  "amount": 1,
  "measure": "tsp"
  },
  {
  "name": "black pepper",
  "amount": 1,
  "measure": "tsp"
  }
  ],
  "category": {
  "mealType": "Main",
  "meal": "Jollof Rice",
  "region": "West African"
  },
  "image": "/imgs/recept/jollofRice.jpg",

  "preparationTime": 15,

  "cookingTime": 45,

  "portion": 6,

  "comments": [],

  "recipeRanking": [],

  "explanation": "Jollof rice is a popular West African dish that is often served at parties and special occasions. It's a one-pot dish that is made with rice, vegetables, and a tomato-based sauce. The key to making great Jollof rice is to use the right spices and to cook the rice until it's tender and fluffy."
},
{
  "name": "African Peanut Stew",
  "description": [
    "Heat oil in a large pot over medium heat. Add onion and sauté until tender, about 5 minutes. Add garlic and ginger and sauté for another minute.",
    "Stir in the sweet potatoes, tomatoes, and vegetable broth. Bring to a boil, then reduce heat and simmer until the sweet potatoes are tender, about 15-20 minutes.",
    "Stir in the peanut butter, chickpeas, and spinach. Cook until the spinach is wilted and the stew is heated through, about 5-10 minutes.",
    "Season with salt and pepper to taste. Serve hot with crusty bread or rice."
  ],
  "ingredients": [
    {
      "name": "vegetable oil",
      "amount": 2,
      "measure": "tbsp"
    },
    {
      "name": "onion (diced)",
      "amount": 1,
      "measure": "large"
    },
    {
      "name": "garlic (minced)",
      "amount": 3,
      "measure": "clove(s)"
    },
    {
      "name": "ginger (minced)",
      "amount": 1,
      "measure": "tsp"
    },
    {
      "name": "sweet potatoes (peeled and cubed)",
      "amount": 2,
      "measure": "medium"
    },
    {
      "name": "canned tomatoes",
      "amount": 230,
      "measure": "ml"
    },
    {
      "name": "vegetable broth",
      "amount": 4,
      "measure": "cups"
    },
    {
      "name": "peanut butter",
      "amount": 0.5,
      "measure": "cup"
    },
    {
      "name": "canned chickpeas (drained and rinsed)",
      "amount": 230,
      "measure": "ml"
    },
    {
      "name": "fresh spinach (chopped)",
      "amount": 4,
      "measure": "cups"
    },
    {
      "name": "salt"
    },
    {
      "name": "black pepper"
    }
  ],
  "category": {
    "mealType": "Vegetarian",
    "meal": "Main",
    "region": "African"
  },
  "image": "/imgs/recept/africanPeanutStew.jpg",

  "preparationTime": 30,

  "portion": 4,

  "comments": [],

  "recipeRanking": [],

  "explanation": "This African Peanut Stew recipe is perfect for a cozy and hearty meal on a chilly day. It's packed with healthy ingredients like sweet potatoes, chickpeas, and spinach, and flavored with the rich and nutty taste of peanut butter. Plus, it's vegetarian-friendly and easy to make! Follow along with the recipe below or watch the video for step-by-step instructions."
},
{
  "name": "Köfte (Turkish Meatballs)",
  "description": [
    "Preheat the oven to 200°C.",
    "In a mixing bowl, combine 500g of ground beef, 1 grated onion, 1/2 cup of breadcrumbs, 1 egg, 2 cloves of minced garlic, 1/2 teaspoon of ground cumin, 1/2 teaspoon of ground coriander, 1/2 teaspoon of paprika, 1/2 teaspoon of salt, and 1/4 teaspoon of black pepper. Mix well until all the ingredients are evenly combined.",
    "Take a small amount of the mixture and shape it into a ball, about the size of a golf ball. Repeat with the rest of the mixture, making about 20-25 meatballs.",
    "Place the meatballs on a baking tray lined with parchment paper, making sure they are not touching. Bake in the preheated oven for 20-25 minutes, or until cooked through and golden brown on the outside.",
    "Serve the köfte with a side of salad, rice, and/or pide bread. Afiyet olsun (enjoy your meal)!"
  ],
  "ingredients": [
    {
      "name": "ground beef",
      "amount": 500,
      "measure": "g"
    },
    {
      "name": "onion (grated)",
      "amount": 1,
      "measure": "medium"
    },
    {
      "name": "breadcrumbs",
      "amount": 120,
      "measure": "g"
    },
    {
      "name": "egg",
      "amount": 1
    },
    {
      "name": "garlic (minced)",
      "amount": 2,
      "measure": "clove(s)"
    },
    {
      "name": "ground cumin",
      "amount": 1,
      "measure": "tsp"
    },
    {
      "name": "ground coriander",
      "amount": 1,
      "measure": "tsp"
    },
    {
      "name": "paprika",
      "amount": 1,
      "measure": "tsp"
    },
    {
      "name": "salt",
      "amount": 1,
      "measure": "tsp"
    },
    {
      "name": "black pepper",
      "amount": 0.25,
      "measure": "tsp"
    }
  ],
  "category": {
    "mealType": "Main",
    "meal": "Meat",
    "region": "Turkish"
  },
  "image": "/imgs/recept/kofte.jpg",

  "preparationTime": 20,

  "portion": 4,

  "comments": [],

  "recipeRanking": [],

  "explanation": "Köfte is a popular Turkish dish made with ground meat and spices. It's a staple of Turkish cuisine and can be found in restaurants and homes all over the country. This recipe is easy to make and perfect for a quick and delicious dinner. Serve with a side of salad and/or rice for a complete meal." 
},
{
  "name": "Greek Salad",
  "description": [
      "Cut the cucumber into small pieces and place in a large bowl. Add the cherry tomatoes, red onion, and olives.",
      "Crumble the feta cheese over the vegetables.",
      "In a small bowl, whisk together the olive oil, red wine vinegar, lemon juice, oregano, salt, and pepper. Drizzle over the salad and toss gently to combine.",
      "Serve chilled with fresh bread."
  ],
  "ingredients": [
      {
          "name": "cucumber",
          "amount": 1,
          "measure": "piece(s)"
      },
      {
          "name": "cherry tomatoes",
          "amount": 250,
          "measure": "g"
      },
      {
          "name": "red onion",
          "amount": 1,
          "measure": "piece(s)"
      },
      {
          "name": "kalamata olives",
          "amount": 100,
          "measure": "g"
      },
      {
          "name": "feta cheese",
          "amount": 200,
          "measure": "g"
      },
      {
          "name": "olive oil",
          "amount": 60,
          "measure": "ml"
      },
      {
          "name": "red wine vinegar",
          "amount": 30,
          "measure": "ml"
      },
      {
          "name": "lemon juice",
          "amount": 1,
          "measure": "tbsp"
      },
      {
          "name": "dried oregano",
          "amount": 1,
          "measure": "tsp"
      },
      {
          "name": "salt"
      },
      {
          "name": "black pepper"
      }
  ],
  "category": {
      "mealType": "Salad",
      "meal": "Lunch/Dinner",
      "region": "Greek"
  },
  "image": "/imgs/recept/greekSalad.jpg",

  "preparationTime": 10,

  "portion": 2,

  "comments": [],

  "recipeRanking": [],

  "explanation": "This traditional Greek salad is a refreshing and healthy dish that can be enjoyed as a light lunch or side dish. It's easy to make and bursting with flavor from the fresh vegetables, salty olives, and tangy feta cheese. Try it out for your next meal and enjoy a taste of Greece!" 
},
{
  "name": "Coq au Vin",
  "description": [
    "Coq au Vin is a classic French dish that is perfect for a special dinner or entertaining guests. It's a slow-cooked chicken dish that's flavored with red wine, bacon, mushrooms, and herbs. It's typically served with mashed potatoes or crusty bread to soak up all of the delicious sauce.",
    "To make Coq au Vin, you'll need to marinate the chicken in red wine for at least a few hours, or overnight if possible. This helps to tenderize the meat and infuse it with flavor. Once the chicken is marinated, you'll brown it in a pan and then cook it with the other ingredients in a Dutch oven or heavy-bottomed pot.",
    "This recipe calls for a full-bodied red wine, like a Burgundy or a Côtes du Rhône. You can also use a Pinot Noir or a Chianti. The bacon adds a smoky flavor, while the mushrooms and herbs add depth and complexity to the dish."
  ],
  "ingredients": [
    {
      "name": "chicken legs",
      "amount": 4,
      "measure": "pieces"
    },
    {
      "name": "full-bodied red wine",
      "amount": 750,
      "measure": "ml"
    },
    {
      "name": "bacon",
      "amount": 100,
      "measure": "g"
    },
    {
      "name": "button mushrooms",
      "amount": 200,
      "measure": "g"
    },
    {
      "name": "onion",
      "amount": 1,
      "measure": "large"
    },
    {
      "name": "carrot",
      "amount": 1,
      "measure": "large"
    },
    {
      "name": "garlic",
      "amount": 4,
      "measure": "cloves"
    },
    {
      "name": "fresh thyme",
      "amount": 2,
      "measure": "sprigs"
    },
    {
      "name": "fresh parsley",
      "amount": 1,
      "measure": "handful"
    },
    {
      "name": "all-purpose flour",
      "amount": 2,
      "measure": "tbsp"
    },
    {
      "name": "chicken stock",
      "amount": 500,
      "measure": "ml"
    },
    {
      "name": "butter",
      "amount": 30,
      "measure": "g"
    },
    {
      "name": "olive oil",
      "amount": 30,
      "measure": "ml"
    },
    {
      "name": "salt"
    },
    {
      "name": "black pepper"
    }
  ],
  "category": {
    "mealType": "Main Course",
    "meal": "Dinner",
    "region": "French"
  },
  "image": "/imgs/recept/coq-au-vin.jpg",

  "preparationTime": 30,

  "portion": 4,

  "comments": [],

  "recipeRanking": [],

  "explanation": "Coq au Vin can also be made with a whole chicken or chicken thighs, depending on your preference. You can also add pearl onions to the recipe for extra flavor."
}






  
]
